Ran Plan for dir: `terragrunt/kubernetes/renovate` workspace: `terragrunt_kubernetes_renovate`

<details><summary>Show Output</summary>

```diff
Authenticated

01:00:57.295 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/tFe0G3-arEI9V3vCSOfX6t6CedE/uN1d46ksxn_NOP50WnZPQN23DnY
01:00:57.319 INFO   tofu: Initializing the backend...
01:00:57.587 INFO   tofu: Initializing provider plugins...
01:00:57.587 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
01:00:58.389 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
01:00:58.552 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
01:00:58.687 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
01:00:58.858 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
01:00:58.968 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
01:00:59.685 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
01:00:59.929 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
01:01:00.095 INFO   tofu: - Using previously-installed gavinbunney/kubectl v1.19.0
01:01:00.110 INFO   tofu: - Using previously-installed aminueza/minio v3.5.0
01:01:00.186 INFO   tofu: - Using previously-installed cloudflare/cloudflare v5.4.0
01:01:00.206 INFO   tofu: - Using previously-installed hashicorp/vault v4.8.0
01:01:00.215 INFO   tofu: - Using previously-installed telmate/proxmox v3.0.1-rc8
01:01:00.245 INFO   tofu: - Using previously-installed hashicorp/kubernetes v2.36.0
01:01:00.280 INFO   tofu: - Using previously-installed hashicorp/helm v3.0.0-pre2
01:01:00.300 INFO   tofu: - Using previously-installed goauthentik/authentik v2025.4.0
01:01:00.300 INFO   tofu: OpenTofu has been successfully initialized!
01:01:00.936 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
01:01:00.936 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
01:01:00.936 STDOUT tofu:   ~ update in-place
01:01:00.936 STDOUT tofu: OpenTofu will perform the following actions:
01:01:00.936 STDOUT tofu:   # helm_release.renovate will be updated in-place
01:01:00.936 STDOUT tofu:   ~ resource "helm_release" "renovate" {
01:01:00.936 STDOUT tofu:       ~ id                         = "renovate" -> (known after apply)
01:01:00.937 STDOUT tofu:       ~ metadata                   = {
01:01:00.937 STDOUT tofu:           ~ app_version    = "41.42.1" -> (known after apply)
01:01:00.937 STDOUT tofu:           ~ chart          = "renovate" -> (known after apply)
01:01:00.937 STDOUT tofu:           ~ first_deployed = 1746674676 -> (known after apply)
01:01:00.937 STDOUT tofu:           ~ last_deployed  = 1753146385 -> (known after apply)
01:01:00.937 STDOUT tofu:           ~ name           = "renovate" -> (known after apply)
01:01:00.937 STDOUT tofu:           ~ namespace      = "renovate" -> (known after apply)
01:01:00.937 STDOUT tofu:           ~ revision       = 32 -> (known after apply)
01:01:00.937 STDOUT tofu:           ~ values         = jsonencode(
01:01:00.937 STDOUT tofu:                 {
01:01:00.937 STDOUT tofu:                   - envFrom  = [
01:01:00.937 STDOUT tofu:                       - {
01:01:00.937 STDOUT tofu:                           - secretRef = {
01:01:00.937 STDOUT tofu:                               - name = "renovate-env"
01:01:00.937 STDOUT tofu:                             }
01:01:00.937 STDOUT tofu:                         },
01:01:00.937 STDOUT tofu:                     ]
01:01:00.937 STDOUT tofu:                   - renovate = {
01:01:00.937 STDOUT tofu:                       - config = jsonencode(
01:01:00.937 STDOUT tofu:                             {
01:01:00.937 STDOUT tofu:                               - gitAuthor    = "YouHide Renovate Bot <youhide_renovate@none.com>"
01:01:00.937 STDOUT tofu:                               - platform     = "github"
01:01:00.937 STDOUT tofu:                               - repositories = [
01:01:00.937 STDOUT tofu:                                   - "youhide/hideForming",
01:01:00.937 STDOUT tofu:                                 ]
01:01:00.937 STDOUT tofu:                             }
01:01:00.937 STDOUT tofu:                         )
01:01:00.937 STDOUT tofu:                     }
01:01:00.937 STDOUT tofu:                 }
01:01:00.937 STDOUT tofu:             ) -> (known after apply)
01:01:00.937 STDOUT tofu:           ~ version        = "41.42.1" -> (known after apply)
01:01:00.937 STDOUT tofu:         } -> (known after apply)
01:01:00.937 STDOUT tofu:         name                       = "renovate"
01:01:00.938 STDOUT tofu:       ~ version                    = "41.42.1" -> "41.46.3"
01:01:00.938 STDOUT tofu:         # (26 unchanged attributes hidden)
01:01:00.938 STDOUT tofu:     }
01:01:00.938 STDOUT tofu: Plan: 0 to add, 1 to change, 0 to destroy.
01:01:00.938 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terragrunt/kubernetes/renovate -w terragrunt_kubernetes_renovate
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.localdomain:4141/lock?id=youhide%252FhideForming%252Fterragrunt%252Fkubernetes%252Frenovate%252Fterragrunt_kubernetes_renovate)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terragrunt/kubernetes/renovate -w terragrunt_kubernetes_renovate
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```